/** @file
********************************************************************************
<PRE>
模块名: 特征向量聚类过程
文件名: cluster.h
相关文件: cluser.c
文件实现功能: 特征向量聚类函数声明
作者: Dake
版本: V2010.09.01
编程方式: ANSI C语言编程
授权方式: Copyright(C) Dake
联系方式: chen423@yeah.net
生成日期: 2010-07-05
--------------------------------------------------------------------------------
多线程安全性: <是/否>[，说明]
异常时安全性: <是/否>[，说明]
--------------------------------------------------------------------------------
备注: 
--------------------------------------------------------------------------------
修改记录:
日 期        版本     修改人              修改内容
YYYY/MM/DD   X.Y      <作者或修改者名>    <修改内容>
</PRE>
*******************************************************************************/

#include "gmm.h"

void k_means(double ** c_vector, GMM * pGMM, int * clusterIndex,  int * cSize, int train_frame_num, int m);