/** @file
********************************************************************************
<PRE>
模块名: 基二时域快速傅立叶变换
文件名: FFT2.h
相关文件: FFT2.c
文件实现功能: 声明基二时域快速傅立叶变换相关函数
作者: Dake
版本: V2010.09.01
编程方式: ANSI C语言编程
授权方式: Copyright(C) Dake
联系方式: chen423@yeah.net
生成日期: 2010-06-22
--------------------------------------------------------------------------------
多线程安全性: <是/否>[，说明]
异常时安全性: <是/否>[，说明]
--------------------------------------------------------------------------------
备注: <其它说明>
--------------------------------------------------------------------------------
修改记录:
日 期        版本     修改人              修改内容
YYYY/MM/DD   X.Y      <作者或修改者名>    <修改内容>
</PRE>
*******************************************************************************/
#ifndef _FFT2_
#define _FFT2_

#include <stdio.h>
#include <malloc.h>
#include <math.h>
#include "global.h"


/**
 * @brief 复数结构
 */
typedef struct COMPX
{
    double real; //!< 实部
    double imag; //!< 虚部
} COMPX;


void FFT2(COMPX * xin, int N);

#endif    //_FFT2_
