/** @file
********************************************************************************
<PRE>
模块名: 声纹识别
文件名: voiceIdentify.h
相关文件: voiceIdentify.c
文件实现功能: 声明声纹识别相关函数
作者: Dake
版本: V2010.09.01
编程方式: ANSI C语言编程
授权方式: Copyright(C) Dake
联系方式: chen423@yeah.net
生成日期: 2010-06-22
--------------------------------------------------------------------------------
多线程安全性: <是/否>[，说明]
异常时安全性: <是/否>[，说明]
--------------------------------------------------------------------------------
备注: <其它说明>
--------------------------------------------------------------------------------
修改记录:
日 期        版本     修改人              修改内容
YYYY/MM/DD   X.Y      <作者或修改者名>    <修改内容>
</PRE>
*******************************************************************************/
#ifndef _VOICE_IDENTIFY_
#define  _VOICE_IDENTIFY_

#include "mfcc.h"
#include "gmm.h"


#endif  //_VOICE_IDENTIFY_
